{"pages":[{"title":"about","text":"之前的博客搬迁，之后再慢慢补充… document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/about/index.html"}],"posts":[{"title":"[E] The 7 Types of People You Will Meet on Hong Kong’s MTR","text":"From Article  :The 7 Types of People You Will Meet on Hong Kong’s MTR Note ✏ seasoned Hongkonger  there’s one thing about this city that never ceases to amaze us – the MTR. XXX never ceased to amaze us  From loved-up couples who are way too keen to show their affection, to those who seem to lack volume control when speaking on their phones, here are 7 types of people we’ve all had to deal with when travelling on the MTR. loved-up couples way too keen to 太热衷于 lack volume control  It’s rush hour, people are pouring in, and everyone wants a piece of the pole. Fat chance if you have a pole hogger on the train. Fat chance从表面上来看应该是机会很多。不然,Fat chance是指机会很少  Whether they’re leaning their entire body against it, or simply won’t budge to make space for others, pole hoggers are not the friendliest of people you will come across on the MTR budge V-ERG （使）改变主意；（使）让步eg:Both sides say they will not budge. Action: You could try and ask them to politely move, but don’t expect much other than a cold, hard death stare.  It’s bad enough being so uncomfortably close with a bunch of strangers on a train, but when there’s a loud talker on board, you’re never going to hear the end of it – literally. Unfortunately, there’s not much you can do with this one  Believe us, many people have tried only to end up starring in the latest viral video of yet another screaming match on the MTR. Best advice we have is to just stick in your headphones and turn up the volume. waves of people sprinting across station platforms for minutes on end连续几分钟eg:He stormed at me for five minutes on end groping咸猪手  So you’ve hit the snooze button one too many times and now you’re running late for work The Time Savers part is fun. hhhhaaa  Just when you thought the train carriage was full and you couldn’t possibly fit into that tiny space that’s left by the door, the space invaders come along to prove you wrong. 上面这个表述也很有趣，想起老友记里面Phoebe和Ross争论进化论的可能性的时候，Phoebe用很搞笑的语气对Ross说 “Now, are you telling me that you are so unbelievably arrogant that you can’t admit that there’s a teeny tiny possibility that you could be wrong about this?” 模拟Phoebe语气读几遍hhhhhhaaa  No, we’re not talking about the retro 70s video game, we’re talking about the portion of people on the MTR who seem to be able to defy the laws of physics and squeeze and push their way onto the train, even when there’s clearly no more space (or so you thought). defy the laws of physics  When things start to get a little bit too close for comfort on the MTR, a little skin-on-skin action is unavoidable. too close for comforteg:The guy behind is too close for comfort!在后面追赶的家伙“逼得太紧”了! - unsavouryIf you describe a person, place, or thing as unsavoury, you mean that you find them unpleasant or morally unacceptable.eg:Her friends are all pretty unsavoury characters.她的朋友尽是些不三不四的人。  While it doesn’t happen as much as it used to, there’s still always one or two creepy pervs lurking about on the train. Whether it’s their wandering eyes that make you feel uneasy, or it feels like someone is intentionally getting close to you, don’t be afraid to speak up and put them in their place! document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/2018/11/16/7typePeopleOnHKMTR/"},{"title":"Nov","text":"Hm…博客搬迁，之前的笔记杂乱无规则，要整理发现十分困难，因此不打算迁移了。 碎碎念   因为刚看完18年AWS re:invent大会，所以选了Andy Jassy大会上演讲截图做为该篇文章的概要图。这场将近3个小时的演讲，发布了超过20款云端产品，其中半数都与机器学习切身相关。全程看下来其实半懵半懂，但可以感觉到AWS今年在云端AI与机器学习这块市场布局表现得很积极，将近半数的云产品发布都是着重在提供更多机器学习自动化，管理及部署工具。大会还邀请了F1的Managing Director-Ross Brawn分享赛车运动如何管理大数据。 感兴趣的童靴 AWS re:Invent 2018 - Keynote with Andy Jassy    话说回来我的SAA备考又在闲置中…国庆那段时间突击考点全程过目一遍后，就没在复习了。但因为这两个月在着手准备另一件更重要的事，现在已经实现了。所以12月份的目标就是尽快把复习资料重新学习一遍，明年一月份报考。 Nov. in 2018   11月过得很匆忙。但神奇的是，越忙碌的状态下，做事的效率更高。或许是划重点的能力增强了，懂得取舍。Get your priorities straight and do it right. 这次我不想再耗费脑细胞去回顾这个月都做了什么了，取而代之，mark一下这个月发现的许多很有用的小工具，用起来工作学习效率真的提高了好多丫~ Lepton &amp; KeepNote   Lepton是个宝，主要是用来记录一些代码片段。程序O啊，是真应该多看看别人的代码才知道自己写的都是一坨不堪入眼的东西…为了追随各位大神的脚步，是应该记录一下编程界的葵花宝典。 当然一些为了避免重复造轮子的代码，也是值得记录收藏的，书到用时复制粘贴    作者花了大约三个星期写出的一个Electron的GitHub Gist管理软件，如今在GitHub上星数已经4000+。之所以喜欢这个笔记软件，是因为对于程序O来说真的是太方便了。作者在简书还曾分享过开发这个项目的经验，感兴趣的童靴 打造GitHub千星项目的经验分享    另一个小工具其实是我用来碎碎念的备忘录，来自Google的Keep - Notes and Lists。这个app一直隐藏在手机的小角落，近期才开始留意，我大部分是用来摘录语句…   滴答清单   其实我并不是一个清单控，我是一个随性的人哈哈哈哈… 用上这个小工具，是受到工作中项目敏捷开发思想的启发。公司是用Jira来进行项目管理的，分配不同的task，评估分值。私底下我用滴答清单也给自己弄了个sprint task的栏目… 把每一天要处理的问题都一条条列出来。好处自然是有序明了，但我发现这样做导致的问题是，一个task刚记录，就会联想到有另一个task也要处理…永不停息的task list   算法学习   这个虽然不是小工具，却是我近期开始看的东西…之前有个同事给我推荐了几个算法在线编程平台，其中大家比较熟悉的应该是LeetCode了。说真，里面的题目，我一般都得绞尽脑汁思考好一会，也不一定思考得出来…但是看完别人的解答，惊叹之余还不免怀疑自个智商…前段时间在youtobe发现一个很棒的channel，主要是分享一些算法面试题的。博主叫Kevin，a nice person，每个人的评论他都很用心评论了哈哈哈哈 其实还有另一个大神级别的YouTober…Patrick Shyu。 有一次YouTobe推了一个他分享的Software Design Patterns and Principles，我深深折服于…他那如冲机枪般的语速 ，滔滔不绝毫无喘气跟你絮絮叨叨一大堆知识。因为好奇，我google了下他的linkedin Profile…Hm….   To be continue… document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/2018/12/01/Nov/"},{"title":"MarkdownTesting","text":"bold text italicized text blockquote First item Second item Third item First item Second item Third item Syntax Description Header Title Paragraph Text Write the press release Update the website Contact the media 12345{ &quot;firstName&quot;: &quot;John&quot;, &quot;lastName&quot;: &quot;Smith&quot;, &quot;age&quot;: 25} 区块Hello world cxx~ POST 12345public class Main { public static void main(String[] args) { System.out.println(&quot;Hello world&quot;); }} Gallery pulugin ReferenceA quick reference to the Markdown syntax.Cmd Markdown 编辑阅读器 document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/2018/11/30/MarkdownTesting/"}],"tags":[{"name":"Localiiz Article","slug":"Localiiz-Article","link":"/tags/Localiiz-Article/"},{"name":"Summary Random Monthly","slug":"Summary-Random-Monthly","link":"/tags/Summary-Random-Monthly/"},{"name":"Markdown Testing","slug":"Markdown-Testing","link":"/tags/Markdown-Testing/"}],"categories":[{"name":"English Learning","slug":"English-Learning","link":"/categories/English-Learning/"},{"name":"End of Month","slug":"End-of-Month","link":"/categories/End-of-Month/"}]}