{"pages":[{"title":"about","text":"之前的博客搬迁，之后再慢慢补充… document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/about/index.html"}],"posts":[{"title":"[E] The 7 Types of People You Will Meet on Hong Kong’s MTR","text":"From Article  :The 7 Types of People You Will Meet on Hong Kong’s MTR Note ✏ seasoned Hongkonger  there’s one thing about this city that never ceases to amaze us – the MTR. XXX never ceased to amaze us  From loved-up couples who are way too keen to show their affection, to those who seem to lack volume control when speaking on their phones, here are 7 types of people we’ve all had to deal with when travelling on the MTR. loved-up couples way too keen to 太热衷于 lack volume control  It’s rush hour, people are pouring in, and everyone wants a piece of the pole. Fat chance if you have a pole hogger on the train. Fat chance从表面上来看应该是机会很多。不然,Fat chance是指机会很少  Whether they’re leaning their entire body against it, or simply won’t budge to make space for others, pole hoggers are not the friendliest of people you will come across on the MTR budge V-ERG （使）改变主意；（使）让步eg:Both sides say they will not budge. Action: You could try and ask them to politely move, but don’t expect much other than a cold, hard death stare.  It’s bad enough being so uncomfortably close with a bunch of strangers on a train, but when there’s a loud talker on board, you’re never going to hear the end of it – literally. Unfortunately, there’s not much you can do with this one  Believe us, many people have tried only to end up starring in the latest viral video of yet another screaming match on the MTR. Best advice we have is to just stick in your headphones and turn up the volume. waves of people sprinting across station platforms for minutes on end连续几分钟eg:He stormed at me for five minutes on end groping咸猪手  So you’ve hit the snooze button one too many times and now you’re running late for work The Time Savers part is fun. hhhhaaa  Just when you thought the train carriage was full and you couldn’t possibly fit into that tiny space that’s left by the door, the space invaders come along to prove you wrong. 上面这个表述也很有趣，想起老友记里面Phoebe和Ross争论进化论的可能性的时候，Phoebe用很搞笑的语气对Ross说 “Now, are you telling me that you are so unbelievably arrogant that you can’t admit that there’s a teeny tiny possibility that you could be wrong about this?” 模拟Phoebe语气读几遍hhhhhhaaa  No, we’re not talking about the retro 70s video game, we’re talking about the portion of people on the MTR who seem to be able to defy the laws of physics and squeeze and push their way onto the train, even when there’s clearly no more space (or so you thought). defy the laws of physics  When things start to get a little bit too close for comfort on the MTR, a little skin-on-skin action is unavoidable. too close for comforteg:The guy behind is too close for comfort!在后面追赶的家伙“逼得太紧”了! - unsavouryIf you describe a person, place, or thing as unsavoury, you mean that you find them unpleasant or morally unacceptable.eg:Her friends are all pretty unsavoury characters.她的朋友尽是些不三不四的人。  While it doesn’t happen as much as it used to, there’s still always one or two creepy pervs lurking about on the train. Whether it’s their wandering eyes that make you feel uneasy, or it feels like someone is intentionally getting close to you, don’t be afraid to speak up and put them in their place! document.querySelectorAll('.github-emoji') .forEach(el => { if (!el.dataset.src) { return; } const img = document.createElement('img'); img.style = 'display:none !important;'; img.src = el.dataset.src; img.addEventListener('error', () => { img.remove(); el.style.color = 'inherit'; el.style.backgroundImage = 'none'; el.style.background = 'none'; }); img.addEventListener('load', () => { img.remove(); }); document.body.appendChild(img); });","link":"/2018/11/16/7typePeopleOnHKMTR/"}],"tags":[{"name":"testing","slug":"testing","link":"/tags/testing/"},{"name":"Localiiz Article","slug":"Localiiz-Article","link":"/tags/Localiiz-Article/"}],"categories":[{"name":"helloworld","slug":"helloworld","link":"/categories/helloworld/"},{"name":"English Learning","slug":"English-Learning","link":"/categories/English-Learning/"}]}